{
  "id": "DiveOperations/DiveLogApp",
  "title": "Logging Dives",
  "content": "<h1>How-To Guide: Using the Sea Saba Dive Log App</h1>\n<p>!!! alert\n    <strong>Note:</strong> This SOP reflects the updated Dive Log app following migration. The correct link is <a href=\"https://sea-saba-self.vercel.app/\">https://sea-saba-self.vercel.app/</a>. Please disregard old links.  </p>\n<h2>Introduction</h2>\n<p>The Sea Saba Dive Log App is an in-house developed application designed for logging diving activities and recording sightings of specific marine species as identified by the Saba Marine Park. This guide provides detailed instructions on how to use the app effectively.  </p>\n<h2>User Registration</h2>\n<h3>Desktop</h3>\n<ol>\n<li>Click the <strong>Register</strong> button at the top-right of the screen and follow the prompts.  </li>\n<li>After registering, an <strong>admin must assign privileges</strong> before you can log dives or view entries.  </li>\n<li>To reset your password, open the <strong>Login</strong> menu, enter your email, and click the <strong>Reset Password</strong> link at the bottom of the form.</li>\n</ol>\n<p><img src=\"../Images/DiveLog/LoginDesktop.png\" alt=\"Home page Desktop\"><br><img src=\"../Images/DiveLog/Register.png\" alt=\"Register Page\"><br><img src=\"../Images/DiveLog/Login.png\" alt=\"Login Page\">  </p>\n<h3>Mobile</h3>\n<ol>\n<li>Tap the menu button (three horizontal lines in the top-right).  </li>\n<li>Select <strong>Register</strong> and follow the prompts.  </li>\n<li>Use the <strong>Reset Password</strong> link on the login screen if necessary.</li>\n</ol>\n<p><img src=\"../Images/DiveLog/LoginMobile.png\" alt=\"Home page Mobile\">  </p>\n<h2>User Profile</h2>\n<ol>\n<li>Go to the <strong>Profile</strong> menu.  </li>\n<li>Update your name, reset your password, and set your preferred units.  </li>\n<li>Your <strong>role</strong> is also displayed here. If it shows <strong>“viewer”</strong>, you will not be able to use the app — please notify an admin to update your role.  </li>\n<li>The app defaults to metric units, but will convert values to imperial if selected.</li>\n</ol>\n<p><img src=\"../Images/DiveLog/Profile.png\" alt=\"Profile Page\">  </p>\n<h2>Logging a Dive</h2>\n<ol>\n<li>From the home page, click <strong>Dive Log — Log a Dive</strong> in the navbar, or use the <strong>Dive Log</strong> link on the home page.  </li>\n<li>Complete the multi-step form to log your dive and sightings.  </li>\n<li>Review your entry on the confirmation screen before submitting.<br>⚠️ If you see <strong>NaN</strong> (Not a Number) in a numeric field (e.g., temperature or depth), simply type over it with the correct value.</li>\n</ol>\n<p><img src=\"../Images/DiveLog/LogADive.png\" alt=\"Logging a Dive\">  </p>\n<h2>Viewing Previous Entries</h2>\n<ol>\n<li>From the home page, click <strong>Dive Log — View Dives</strong> in the navbar, or use the <strong>View Dives</strong> link on the home page.  </li>\n<li>Sort entries by boat, dive site, dive guide, or species.  </li>\n<li>Click the <strong>Sightings</strong> button to view species recorded for a dive.  </li>\n<li>Update dive information or edit sightings as necessary.  <ul>\n<li>Only admins or the user who created the entry can make edits.<br>⚠️ Delete an entry only if entered in error. Deletions are irreversible.</li>\n</ul>\n</li>\n</ol>\n<p><img src=\"../Images/DiveLog/ViewADive.png\" alt=\"Viewing an Entry\"><br><img src=\"../Images/DiveLog/Sightings.png\" alt=\"Sightings\">  </p>\n<h2>Important Notes</h2>\n<ul>\n<li>The app is designed to log only <strong>species of concern</strong> as identified by the Saba Marine Park.  </li>\n<li>Each dive guide can log only <strong>one entry per dive site, per date, per dive number</strong>.  </li>\n<li>All dive logs are displayed on the main Sea Saba website.  </li>\n<li>Notify a manager or admin if dive sites or species lists need to be updated.<br>⚠️ All dives must be logged by the <strong>end of each day</strong>.</li>\n</ul>\n",
  "excerpt": "How-To Guide: Using the Sea Saba Dive Log App\r \r !!! alert\r     Note: This SOP reflects the updated Dive Log app following migration. The correct...",
  "path": "/DiveOperations/DiveLogApp",
  "lastModified": "2025-12-04T16:50:37.185Z",
  "category": "Diving Operations"
}