{
  "id": "Equipment/SOPVehicleMaint",
  "title": "Vehicle Maintenance SOP",
  "content": "<h1>Standard Operating Procedure (SOP) for Vehicle Maintenance</h1>\n<h2>Purpose</h2>\n<p>To maintain the regular upkeep and ensure operational readiness of the White Crew Truck, White Flatbed, and Blue Flatbed vehicles at Sea Saba.</p>\n<h2>Scope</h2>\n<p>This SOP is applicable to all staff members who operate the White Crew Truck, White Flatbed, and Blue Flatbed vehicles.</p>\n<h2>Procedure</h2>\n<h3>Regular Servicing</h3>\n<ol>\n<li><strong>Servicing Schedule</strong>: Service the White Crew Truck, White Flatbed, and Blue Flatbed every three months (March, June, September, December).</li>\n<li><strong>Service Location</strong>: Perform servicing at Bennet&#39;s Garage.<ul>\n<li>Contact: +599-416-2331 / +599-416-0528</li>\n</ul>\n</li>\n<li><strong>Appointment Booking</strong>: Management will schedule the service appointments.</li>\n</ol>\n<h3>Daily Checks</h3>\n<ol>\n<li><strong>Walkaround Inspection</strong>:<ul>\n<li>Conduct a walkaround inspection before using the vehicle to check tires and surroundings for potential issues.</li>\n</ul>\n</li>\n<li><strong>Interior Inspection</strong>:<ul>\n<li>Inspect the vehicle&#39;s interior for loose items or hazards.</li>\n</ul>\n</li>\n</ol>\n<h3>Fuel Management</h3>\n<ol>\n<li><strong>Fuel Top-Off</strong>: <ul>\n<li>Top off the fuel once per week.</li>\n</ul>\n</li>\n</ol>\n<h3>Cleanliness and Organization</h3>\n<ol>\n<li><strong>Removing Unnecessary Items</strong>:<ul>\n<li>No tools, company equipment, jackets, personal items, etc., are permitted to be left in the vehicle at the end of the shift.</li>\n<li>The vehicle should be left empty unless an item is to be used immediately the following morning.</li>\n</ul>\n</li>\n<li><strong>Lead Weight Management</strong>:<ul>\n<li>If more than 4 lead weights are found in the bed of the truck, redistribute the balance back onto a boat.</li>\n</ul>\n</li>\n</ol>\n<h3>Load Security</h3>\n<ol>\n<li><strong>Ensuring Load Safety</strong>:<ul>\n<li>Ensure that all loads are properly and securely fastened before transit.</li>\n</ul>\n</li>\n</ol>\n<h3>Reporting Issues</h3>\n<ol>\n<li><strong>Immediate Reporting</strong>:<ul>\n<li>Promptly report any issues with the vehicle to Management.</li>\n</ul>\n</li>\n</ol>\n<h2>Accountability</h2>\n<p>All staff members are responsible for adhering to this SOP.</p>\n",
  "excerpt": "Standard Operating Procedure (SOP) for Vehicle Maintenance\r \r  Purpose\r To maintain the regular upkeep and ensure operational readiness of the White...",
  "path": "/Equipment/SOPVehicleMaint",
  "lastModified": "2025-12-04T16:50:37.188Z",
  "category": "Equipment"
}