{
  "id": "GeneralInformation/ProblemSolving",
  "title": "Problem-Solving & Issue Escalation",
  "content": "<h1>Standard Operating Procedure (SOP) for Problem-Solving &amp; Issue Escalation</h1>\n<hr>\n<h2>Purpose</h2>\n<p>To provide a clear, step-by-step framework that empowers all staff members to solve problems independently, minimizing unnecessary interruptions and efficiently using resources.</p>\n<h2>Scope</h2>\n<p>This SOP applies to all employees who need assistance in troubleshooting issues or making decisions within the organization.</p>\n<hr>\n<h2>Procedure</h2>\n<h3>1. The 3-Minute &quot;Google-First&quot; Rule</h3>\n<ul>\n<li><strong>Action</strong>: Spend at least three (3) minutes researching your question or issue using available online tools (e.g., Google, ChatGPT).  </li>\n<li><strong>Objective</strong>: Reduce simple, easily answerable questions directed at managers or executives.  </li>\n<li><strong>Benefit</strong>: Allows team members to develop problem-solving skills and saves time for higher-level tasks.</li>\n</ul>\n<h3>2. The 3-Peer Rule</h3>\n<ul>\n<li><strong>Action</strong>: If you still need help after the initial research, consult at least three (3) peers—this can be coworkers within the company or knowledgeable individuals in public forums.  </li>\n<li><strong>Objective</strong>: Encourage collaboration and leverage the collective experience of colleagues at similar levels.  </li>\n<li><strong>Benefit</strong>: Creates a supportive knowledge-sharing environment and refines potential solutions before escalating an issue.</li>\n</ul>\n<h3>3. The 3-Question “1:3:1” Rule</h3>\n<p>If the issue remains unresolved and requires escalation, come prepared to address these three questions:</p>\n<ol>\n<li><p><strong>What is the actual problem?</strong><br>Provide a clear and concise description of the issue (one or two sentences).</p>\n</li>\n<li><p><strong>What are three (3) possible solutions?</strong><br>Demonstrate you’ve given the problem thoughtful consideration by proposing multiple approaches or options.</p>\n</li>\n<li><p><strong>What do you recommend and why?</strong><br>Present your best guess or hypothesis, even if you’re not 100% certain. This encourages accountability and learning.</p>\n</li>\n</ol>\n<hr>\n<h2>Reporting &amp; Accountability</h2>\n<ul>\n<li><strong>Self-Assessment</strong>: Before escalating any issue, verify you have completed Steps 1 and 2, and prepared answers for Step 3.  </li>\n<li><strong>Manager/Supervisor Review</strong>: Supervisors will ensure adherence by asking staff if they have completed each step. Repeated failure to follow the SOP may result in additional coaching or disciplinary action.</li>\n</ul>\n<p><strong>All staff members are responsible for adhering to this SOP.</strong></p>\n",
  "excerpt": "Standard Operating Procedure (SOP) for Problem-Solving & Issue Escalation\r \r ---\r \r  Purpose\r To provide a clear, step-by-step framework that...",
  "path": "/GeneralInformation/ProblemSolving",
  "lastModified": "2025-12-04T16:50:37.191Z",
  "category": "General Information"
}