{
  "id": "DiveOperations/MorningRoutine",
  "title": "Morning Routine",
  "content": "<h1>Morning Routine for Dive Crew</h1>\n<h2>Opening Procedures</h2>\n<p>Upon arrival, the crew is responsible for getting the dive shop ready for the day. This involves a series of steps to ensure everything is accessible and operational.</p>\n<h3>Unlocking the &quot;Dungeon&quot;</h3>\n<p>The first task is to remove the padlock from the &quot;dungeon,&quot; making sure that the area is accessible for equipment storage and retrieval.</p>\n<h3>Opening the Shutters</h3>\n<p>The crew needs to open the shutters for multiple areas:</p>\n<ul>\n<li>The compressor room.</li>\n<li>The dive center.</li>\n<li>The equipment room.</li>\n</ul>\n<p>!!! note\n      - Captains and Managers have keys.\n      - The controls for the Equipment room are inside the Dive Center.</p>\n<h2>Preparing the Trucks</h2>\n<p>After opening up the dive shop, the next step is to prepare for the day&#39;s diving trips. This involves loading the trucks with all necessary equipment and making sure that everything is accounted for.</p>\n<p>!!! note\n      - If both trucks are available, it is beneficial to load each boat onto a separate truck. \n      - Please do not overload the trucks. Make two trips if needed.</p>\n<h3>Retrieving the Manifests</h3>\n<p>Collect the manifests for the day to determine the needs for tanks and equipment.</p>\n<h3>Loading Tanks</h3>\n<ul>\n<li>Tanks are generally loaded onto the trucks the previous afternoon to reduce workload in the morning.</li>\n<li>Ensure there are enough tanks for all manifested divers and staff.</li>\n<li>Include a spare tank for emergencies.</li>\n<li>Remember to account for tanks left on board from previous dives.</li>\n<li>When in doubt, it&#39;s better to take extra tanks.</li>\n</ul>\n<h3>Equipment Boxes</h3>\n<ul>\n<li>Load equipment boxes for divers onto the trucks. These should have been prepared based on the previous day&#39;s signup but check for any last-minute additions.</li>\n<li>For new divers or last-minute signups, ensure that their equipment boxes are prepared that morning.</li>\n<li>It&#39;s advisable to prepare an extra box with a variety of sizes in rental equipment for any size changes that may be needed. If a size change occurs, remember to update the manifest accordingly.</li>\n</ul>\n<h3>Packing List</h3>\n<p>Refer to the <a href=\"PackingLists.md\">packing list</a> to ensure nothing is forgotten.</p>\n<h2>Getting the Boat(s)</h2>\n<p>By this time in the morning, the Captain(s) will have determined which dock to bring their boat to for loading. While the small pier is preferred for its ease of loading and unloading equipment and guests, availability can vary. On occasions where space is limited, we may need to tie two boats side by side and cross-load equipment. Generally, we aim to accommodate all boats for the day at the small pier, though minor modifications to the process may be necessary.</p>\n<h3>Process Overview</h3>\n<ul>\n<li><p><strong>Dinghy Preparation</strong>: One person is tasked with retrieving the dinghy, while the remainder of the team accompanies the trucks to the designated dock. The dinghy will then be used to transport one captain and one crew member for each boat from the dock to their respective vessels, which are moored offshore. Afterward, the dinghy is securely stored away, and the person responsible assists with further preparations.</p>\n</li>\n<li><p><strong>Preparation at the Dock</strong>: While the dinghy is transferring crew to the boat(s), the remaining crew begins unloading tanks from the truck onto the dock, preparing for the boats&#39; arrival. In scenarios where one boat is scheduled to depart earlier than another—possibly due to the other boat accommodating numerous new divers, for example—this boat should be positioned either in front of the others or on the outside when boats are docked side by side.</p>\n</li>\n</ul>\n<h3>Tasks Upon Reaching the Boat</h3>\n<p>Upon arrival at the boat, the captain and the accompanying crew member must complete a series of essential tasks to ensure the vessel is ready for the day:</p>\n<ul>\n<li><p><strong>Power Up</strong>: Turn on the battery switches to power up the boat.</p>\n</li>\n<li><p><strong>Engine Preparation</strong>: If applicable, trim the engines down, start them to warm up, and verify that everything is functioning correctly.</p>\n</li>\n<li><p><strong>Communications and Electronics</strong>: Activate the radio and other necessary electronics, performing a radio check to ensure communication lines are open and clear.</p>\n</li>\n<li><p><strong>Safety and Mooring Preparations</strong>:</p>\n<ul>\n<li>Deploy the fenders to protect the boat during docking.</li>\n<li>Prepare to release the boat from its mooring by ensuring all lines are ready and secure for a smooth departure to the dock.</li>\n</ul>\n</li>\n</ul>\n<h3>Final Preparations</h3>\n<ul>\n<li>Once the captain has confirmed that the boat is ready and safe for docking, the crew member releases the mooring and prepares the lines for the boat&#39;s arrival at the dock. On Shark Bait and Fin &amp; Tonic, that includes putting the bow line on the cleat.</li>\n<li>If docking side by side, install a smaller fender at mid ship.</li>\n</ul>\n<p>This process ensures that each boat is prepared with efficiency and safety in mind, ready for a day of diving adventures.</p>\n<h2>Loading the Boat(s)</h2>\n<p>When the boat has docked, it&#39;s crucial to follow a systematic process for loading, rather than hastily moving items onboard. The captain—or a designated individual—plays a pivotal role in organizing this process to ensure both efficiency and safety.</p>\n<h3>Initial Steps</h3>\n<ul>\n<li><p><strong>Equipment Verification</strong>: The Captain (or designated person) starts with the manifest to verify the guest equipment (crates) and establish the seating arrangement for the day. This step is fundamental for organizing the loading process and ensuring a smooth operation.</p>\n</li>\n<li><p><strong>Seating Arrangement</strong>: Carefully arranging the seating is essential, especially when the group size necessitates multiple guides. If there are more than 8 guests, indicating two guides will be in the water, it’s important to split the group accordingly. Guests should be seated with their group and other divers they are traveling with to facilitate a natural and streamlined experience.</p>\n</li>\n</ul>\n<h3>Loading Process</h3>\n<ul>\n<li><p><strong>Equipment and Tanks</strong>: Only after seating and equipment arrangements have been decided are tanks loaded onto the boat. Each guest&#39;s equipment is set up on their designated tank, starting from the tank furthest towards the bow and moving towards the stern as the day progresses. For divers stationed at the stern (if side spaces are full), equipment setup moves from the starboard side to the port side (left to right when facing the equipment).</p>\n</li>\n<li><p><strong>Staff Gear</strong>: Simultaneously, water jugs, coolers, and staff gear/tanks can be loaded, with staff tanks always placed at the stern of the boat.</p>\n</li>\n</ul>\n<h3>Safety Checks</h3>\n<ul>\n<li><p><strong>Regulator and Tank Inspection</strong>: For guests using air tanks, connect the regulator, pressurize to check for leaks, then depressurize. This step is crucial for identifying and fixing any leaking tank o-rings before the area becomes crowded with guests.</p>\n</li>\n<li><p><strong>Nitrox Tank Analysis and Recording</strong>: For guests diving with Nitrox, it&#39;s essential to analyze the tank contents and record the results on a Nitrox Sheet before connecting the regulator and performing a leak check. This process involves two staff members: one to analyze the tank and another to record the findings. The Nitrox Sheet includes sections for the guest&#39;s name, tank ID number, oxygen percentage, maximum operating depth (MOD), and a signature field. This procedure not only ensures the safety and correctness of the gas mixtures but also streamlines the process for efficiency. While staff will analyze the tanks, guests are always welcome to use the analyzer themselves to verify the contents. It is mandatory for guests to acknowledge the contents of their tanks by signing the Nitrox Sheet, confirming they are informed and agree with the recorded information.</p>\n</li>\n</ul>\n<h3>Final Preparations</h3>\n<ul>\n<li><p><strong>Check Rental Computers</strong>: Verify that the rental computer is set to the appropriate gas (Air / Nitrox) and set the units based on your best guess as to the guests preference. For example, any non-american guests typically prefer their dive computer to be set to Metric Units. When in doubt, set the units to Imperial. </p>\n</li>\n<li><p><strong>Double-Check</strong>: Ensure that all necessary equipment and supplies are on board before guests arrive. This includes a final check of the equipment, tanks, and additional supplies to avoid any delays or issues during the trip.</p>\n</li>\n<li><p><strong>Prepare to Receive Guests</strong>: With everything in place, the crew should be ready to welcome guests onto the boat, guiding them to their designated seating and briefing them on safety procedures.</p>\n</li>\n</ul>\n<p>This organized approach to loading the boats not only ensures a smooth start to the day&#39;s activities but also enhances the overall guest experience by prioritizing safety and efficiency.</p>\n<h2>Receiving Guests</h2>\n<p>The arrival of guests is a pivotal moment that sets the tone for their experience. It is crucial to manage this process with efficiency and warmth.</p>\n<h3>Guest Arrival</h3>\n<ul>\n<li><p><strong>Greeting</strong>: As soon as a taxi is spotted arriving with guests, a designated crew member from each boat, holding the manifest, should approach the taxi. This crew member&#39;s responsibility is to warmly greet the guests and guide them to the correct boat.</p>\n</li>\n<li><p><strong>Dock Assistance</strong>: Another crew member should be stationed at the dock, ready to assist guests as they board or disembark from the boat. This includes helping carry any personal diving gear to the correct seating area on the boat.</p>\n</li>\n</ul>\n<h3>Onboard Assistance</h3>\n<ul>\n<li><p><strong>Equipment Verification</strong>: Once the guests are directed to their seats, assist them in verifying that all necessary equipment is present, fits properly, and is in serviceable condition. </p>\n</li>\n<li><p><strong>Camera Equipment</strong>: For guests with cameras, offer a camera bag for protection during the trip. These bags are stored in the equipment room and should be readily available.</p>\n</li>\n</ul>\n<h3>Preparing for Departure</h3>\n<ul>\n<li><p><strong>Weight Belts and Weights</strong>: Assist guests in making weight belts or gathering weights for integrated weight pockets, ensuring everyone is properly weighted for the dive.</p>\n</li>\n<li><p><strong>Boat Briefing</strong>: Once all guests are on board and settled, a crew member should conduct the boat briefing. This is an essential safety measure and ensures guests are familiar with the boat&#39;s layout, safety equipment, and protocols.</p>\n</li>\n</ul>\n<p><a href=\"BoatBriefingOverview.md\">Boat Briefing Guide</a></p>\n",
  "excerpt": "Morning Routine for Dive Crew\r \r  Opening Procedures\r \r Upon arrival, the crew is responsible for getting the dive shop ready for the day. This...",
  "path": "/DiveOperations/MorningRoutine",
  "lastModified": "2025-12-04T16:50:37.186Z",
  "category": "Diving Operations",
  "originalId": "DiveOperations/MorningRoutine"
}