{
  "id": "DiveOperations/DiveBriefingOverview",
  "title": "Dive Briefing Overview",
  "content": "<h1>Dive Briefing Overview</h1>\n<p><strong>Dive Site Name:</strong> (Include any interesting stories or facts about the site.)</p>\n<h2>Dive Logistics:</h2>\n<ul>\n<li><strong>Maximum Depth &amp; Estimated Time of Tour:</strong> (Include maximum allowable time if necessary.)</li>\n<li><strong>Dive Guides &amp; Group Management:</strong> (Details on identifying guides and how groups will be split.)</li>\n<li><strong>Buddy System Enforcement:</strong> No solo diving allowed. Divers without a buddy must stay close to a guide.</li>\n<li><strong>Weight Checks:</strong> First-time divers must check their weights at the tag line immediately upon entering the water.</li>\n</ul>\n<h2>Tour Details:</h2>\n<ul>\n<li><p><strong>Route &amp; Highlights:</strong> (Describe the planned route and what divers can expect to see.)</p>\n</li>\n<li><p><strong>Boat Location Communication:</strong> How guides will indicate the boat&#39;s location during the dive.</p>\n</li>\n<li><p><strong>Post-Tour Instructions:</strong> What divers can do before ascending and when should they ascend.</p>\n</li>\n<li><p><strong>Meeting Points:</strong> (Options for group assembly, ensuring clarity on where and how to meet.)</p>\n<ul>\n<li>Meet at the surface at the mooring line, descend as a group.</li>\n<li>Meet at the surface at the tag line, descend as a group.</li>\n<li>Meet on the mooring line, 15 feet deep, descend as a group.</li>\n<li>Buddy teams can descend and meet under the boat / base of the mooring. Experienced buddy teams only!</li>\n</ul>\n</li>\n</ul>\n<h2>Marine Park Guidelines:</h2>\n<ul>\n<li>Strict no-touching, collecting, or contact policy. Be mindful of buoyancy and fin placement. No gloves.</li>\n</ul>\n<h2>Safety and Equipment:</h2>\n<ul>\n<li><strong>Decompression:</strong> No decompression dives, unless specifically planned and certified to do so.</li>\n<li><strong>Dive Computer Requirement:</strong> Essential for monitoring air, depth, and deco. Follow the computer&#39;s instructions for accidental deco stops.</li>\n<li><strong>Air and Depth Monitoring:</strong> Divers are responsible for monitoring their air supply and depth.<ul>\n<li>Alert your guide upon reaching half tank.</li>\n<li>Plan your ascent to return to the boat with at least 500 psi / 50 bar.</li>\n<li>Perform a safety stop for 3-5 minutes, depending on maximum depth reached.</li>\n</ul>\n</li>\n<li><strong>Reiterate Entry and Exit Procedures:</strong> Especially taking fins off on the tag line when rough.</li>\n</ul>\n<h2>Additional Notes:</h2>\n<ul>\n<li><strong>Guide Responsibilities:</strong> Ensure constant guide presence in or near the water as divers enter.</li>\n<li><strong>Group Management:</strong> If feasible, sort groups by skill level or air/nitrox usage to minimize underwater congestion. Advanced or nitrox divers usually enter the water first.</li>\n<li><strong>Guided Dive Protocol:</strong> The tour begins only when all divers are assembled with the guide.</li>\n<li><strong>Air Consumption-Based Tours:</strong> Adapt the tour to match divers&#39; air consumption rates.</li>\n<li><strong>Dive Computer Usage:</strong> Make sure everyone understands how to use their dive computer. Provide guidance for rental units if necessary.</li>\n<li><strong>Compliance with Deco Stops:</strong> Failure to comply with mandatory stops will result in a no-dive penalty for at least 24 hours.</li>\n<li><strong>Handling Accidental Decompression:</strong> Requires a 2-hour surface interval, possibly affecting subsequent dive plans.</li>\n<li><strong>Cancellation and Rescheduling Policy:</strong> Dives cancelled by the diver (due to deco, feeling unwell, etc.) are not refundable or exchangeable, though rescheduling may be possible at the company&#39;s discretion.</li>\n<li><strong>Surface Interval Timing:</strong> Schedule surface intervals strategically to maintain the dive day&#39;s flow without rushing the pre-dive briefing.</li>\n<li><strong>Site Specific Procedures:</strong> Be aware of any specific procedures for individual dive sites.</li>\n</ul>\n<h3>Dive Flexibility:</h3>\n<ul>\n<li>Experienced buddy teams may have the option to diverge from the group, subject to the dive site conditions and the discretion of the Captain/Dive Guide.</li>\n</ul>\n<p><a href=\"../files/Dive%20Briefing%20Overview.pdf\">Download a printable version of this</a></p>\n",
  "excerpt": "Dive Briefing Overview\r \r Dive Site Name: (Include any interesting stories or facts about the site.)\r \r  Dive Logistics:\r - Maximum Depth & Estimated...",
  "path": "/DiveOperations/DiveBriefingOverview",
  "lastModified": "2025-12-04T16:50:37.184Z",
  "category": "Diving Operations",
  "originalId": "DiveOperations/DiveBriefingOverview"
}