{
  "id": "Equipment/CompressorOperation",
  "title": "Compressor Operation",
  "content": "<h1>SOP: Compressor Operations</h1>\n<h2>Purpose</h2>\n<p>The purpose of this Standard Operating Procedure (SOP) is to ensure the safe, efficient, and consistent operation of the compressors used in diving operations at Sea Saba. This SOP provides detailed instructions on operating the compressors, handling associated equipment, and performing routine maintenance tasks. It is designed to uphold the highest standards of safety and quality in our diving services.</p>\n<h2>Scope</h2>\n<p>This SOP applies to all dive staff at Sea Saba who are involved in compressor operations. It covers the procedures for:</p>\n<ul>\n<li>Starting and operating the compressors for air and nitrox filling.</li>\n<li>Performing routine checks and maintenance of the compressors, including oil level checks, air filter inspection, and condensate drainage.</li>\n<li>Ensuring the proper arrangement and filling of diving tanks.</li>\n<li>Adhering to safety protocols to prevent accidents and equipment damage.</li>\n</ul>\n<p>All dive staff members are required to familiarize themselves with these procedures and adhere to them strictly during their compressor room duties.</p>\n<h2>Operational Procedure</h2>\n<h3>Turn on the Equipment:</h3>\n<ul>\n<li>Turn on the breakers for the fans and Compressor 3 (Red Max-Air) when filling air. </li>\n<li>If filling nitrox, also turn on the Nitrox breaker.</li>\n<li>Plug in the heater and dryer (located behind the air dryer on the wall). </li>\n<li>Turn on the dryer (blue machine) to allow it to warm up.</li>\n</ul>\n<p><img src=\"../Images/Compressors/BreakerPanel.jpg\" alt=\"Breaker Panel\">\n<img src=\"../Images/Compressors/Plugs.jpg\" alt=\"Plugs\">\n<img src=\"../Images/Compressors/Dryer.jpeg\" alt=\"Air Dryer\"></p>\n<h3>Check Air Filter and Oil Change Status:</h3>\n<ul>\n<li>Refer to the dry erase board for air filter and oil change status.</li>\n<li>The Nitrox Blue Filters are tracked with the Nitrox Machine Hour meter.</li>\n<li>The Red Compressor and Air Filters are tracked with the Red Compressor Hour meter.</li>\n<li>Refer to <a href=\"CompressorServicing.md\">Compressor Servicing</a> for more information about changing oil and filters.</li>\n</ul>\n<p><img src=\"../Images/Compressors/Whiteboard.jpeg\" alt=\"Status Board\"></p>\n<h3>Check Oil Levels:</h3>\n<ul>\n<li>The Red Compressor has 2 sight glasses. The oil should be approximately halfway up the top sight glass.</li>\n<li>The Nitrox compressor has a screw-in dipstick. The oil should be on the hatch marks.</li>\n<li>If necessary, top up the oil. The Nitrox compressor takes Nuvair 546 oil and the Red Compressor takes SecoLube Tropics. Notify if you had to top up the oil.</li>\n</ul>\n<p>!!! note\n      - Confirm with Management before changing oil due to being &quot;dirty&quot;. </p>\n<p><img src=\"../Images/Compressors/MaxAirOil.jpg\" alt=\"Red Compressor Oil Level\">\n<img src=\"../Images/Compressors/NitroxBackOil.jpg\" alt=\"Nitrox Oil Level\"></p>\n<h3>Drain Condensate:</h3>\n<ul>\n<li>Both the dryer and red compressor have bottles that collect condensate.</li>\n<li>The dryer’s condensate (only water) can be emptied outside.</li>\n<li>The red compressor’s condensate must be emptied into a used oil container for proper disposal.</li>\n</ul>\n<p><img src=\"../Images/Compressors/MaxAirCondensate.jpg\" alt=\"Red Compressor Condensate\"></p>\n<h3>Wipe Down the Machines:</h3>\n<ul>\n<li>Wipe any grease and grime off every day. This makes it easier to spot maintenance issues.</li>\n<li>Alert management if you spot anything of concern.</li>\n</ul>\n<h3>Starting the Compressors:</h3>\n<ul>\n<li>After approximately 5 minutes of warming up the dryer, start the compressors.</li>\n<li>For air filling, start directly. For Nitrox, bleed the system until the air reaches the appropriate oxygen percentage.</li>\n<li>Bleeding the system is done by opening one of the fill whips to atmosphere.</li>\n<li>Watch the Oxygen Sensor to monitor the Oxygen percentage. It is normal on startup for the Oxygen percentage to start around 32% before falling to near 21% and then rising again. You can start filling when the percentage exceeds 31%.</li>\n</ul>\n<p>!!! note\n      - Target percentage is 32.3% +/-. You can adjust using the regulator on the Nitrox machine. Don&#39;t just turn the knob, look at the pressure gauge and adjust up or down as needed. More pressure = higher O2 %.\n      - Ensure that the Oxygen Sensor is calibrated! This can be done by taking off the cap and setting the percentage to 20.9%</p>\n<p><img src=\"../Images/Compressors/BlueFiltersOps.jpg\" alt=\"Adjusting Oxygen Percentage\"></p>\n<h3>Arrange Tanks for Filling:</h3>\n<ul>\n<li>Arrange 4/5 rows of tanks with a clear path to the control panel.</li>\n<li>Stagger the tanks to allow the whips to be placed on the tanks without putting pressure on the stems.</li>\n<li>Connect the fill whips to the row furthest from the wall for efficient operation.</li>\n</ul>\n<p>!!! note\n      - Check each tank for Hydro and Visual Inspection Status. Pull any tanks aside that are due for Hydro or Visual Inspection. Do <strong>NOT</strong> drain the tank unless you are going to complete the VIP that day. Do <strong>NOT</strong> leave tanks without pressure overnight.</p>\n<h3>Filling Procedure Nitrox - Cascade:</h3>\n<ul>\n<li><strong>Duration</strong>: <ul>\n<li>Filling a row of 8 tanks using only the compressor takes approximately <strong>20-30 minutes</strong>.</li>\n<li>Using the cascade system can reduce the filling time to as little as <strong>4-6 minutes</strong>, depending on fill speed. Control the speed by adjusting the bank valves.</li>\n</ul>\n</li>\n</ul>\n<h4>Steps:</h4>\n<ol>\n<li><p><strong>Initial Filling</strong>:</p>\n<ul>\n<li>Begin filling tanks from <strong>Bank 2</strong> and the compressor simultaneously.</li>\n<li>Allow the tanks and Bank 2 to reach equilibrium.</li>\n</ul>\n</li>\n<li><p><strong>Switch Banks</strong>:</p>\n<ul>\n<li><strong>Close Bank 2</strong> before opening <strong>Bank 1</strong> to complete the fill.</li>\n<li>If <strong>Bank 1</strong> is below <strong>3300 psi</strong>, close it after equilibrium is reached and finish topping off the tanks with the compressor.</li>\n</ul>\n</li>\n<li><p><strong>Reaching Full Pressure</strong>:</p>\n<ul>\n<li>Once the tanks reach full pressure (<strong>3300 psi hot</strong>), close the tank valve.</li>\n<li>Open <strong>Bank 1</strong> during the switchover process.</li>\n</ul>\n</li>\n<li><p><strong>Switch Tanks</strong>:</p>\n<ul>\n<li>Replace the filled tanks with new ones and repeat the process.</li>\n<li>If you need to step away, consider filling the banks (Note: <strong>Bank 2</strong> has a maximum pressure of <strong>3000 psi</strong>).</li>\n</ul>\n</li>\n<li><p><strong>Compressor Auto-Shutdown</strong>:</p>\n<ul>\n<li>The system will automatically shut off when it reaches <strong>4500 psi</strong>.</li>\n<li>If the tanks are full and you need to restart the compressor, close the tank valves and then open the appropriate bank valve.</li>\n</ul>\n</li>\n<li><p><strong>Nitrox Compressor Behavior</strong>:</p>\n<ul>\n<li>The Nitrox compressor will not shut down as it continuously supplies enriched air to the high-pressure (red) compressor.</li>\n</ul>\n</li>\n</ol>\n<p><img src=\"../Images/Compressors/PanelClose.jpeg\" alt=\"Fill Panel\"></p>\n<p>!!! alert\n      - <strong>Never open both banks simultaneously!</strong>\n!!! warning\n      - <strong>Maximum Pressure</strong>: Be aware that the max pressure in <strong>Bank 2</strong> is 3000 psi with no auto shutoff. Pay close attention.\n      - <strong>Pressure Regulation</strong>: The pressure to tanks is regulated at 3300 psi; when this is reached, the valve will close, back pressuring the system.\n      - <strong>Restarting Compressors</strong>: If the compressor shuts down at 4500 psi, it’s OK, but avoid making it a habit. Ensure the tank valves are closed before opening the bank valve and restarting the compressor.</p>\n<h3>Filling Procedure Air:</h3>\n<ul>\n<li><strong>Duration</strong>: It takes approximately 20-30 minutes to fill a row of 8 tanks.</li>\n<li><strong>Current System</strong>: As of this writing, we do not have a dedicated air bank system. This is planned for expansion in <strong>Q4 2024</strong>.</li>\n</ul>\n<h4>Steps:</h4>\n<ol>\n<li><p><strong>Begin Filling</strong>:</p>\n<ul>\n<li>Line up the row of tanks and start filling. </li>\n<li>Monitor the pressure as the tanks approach <strong>3000 psi</strong>.</li>\n</ul>\n</li>\n<li><p><strong>Shut Off Half the Tanks</strong>:</p>\n<ul>\n<li>Once half of the tanks reach <strong>3000 psi</strong>, shut them off.</li>\n</ul>\n</li>\n<li><p><strong>Continue Filling to 3300 psi</strong>:</p>\n<ul>\n<li>Allow the other half of the tanks to continue filling until they reach <strong>3300 psi</strong>.</li>\n<li><strong>Note</strong>: Properly timing this will prevent the compressor from shutting off due to back pressure (4500 psi).</li>\n</ul>\n</li>\n<li><p><strong>Switch the Tanks</strong>:</p>\n<ul>\n<li>While the compressor is pumping the second half of the tanks to <strong>3300 psi</strong>, change out the first half of the tanks that were previously shut off.</li>\n</ul>\n</li>\n<li><p><strong>Repeat the Process</strong>:</p>\n<ul>\n<li>Once the second half of tanks reaches <strong>3300 psi</strong>, close them.</li>\n<li>Open the new set of tanks (the first half that was replaced) and repeat the process.</li>\n<li>Continue alternating until all tanks are filled to <strong>3300 psi</strong>.</li>\n</ul>\n</li>\n</ol>\n<h3>Shutting Down</h3>\n<ul>\n<li>The Nitrox Compressor is shut down by rotating the On / Off / Start switch to off. This will start the shutdown procedure which takes approximately 30 seconds. </li>\n<li>The Red Compressor is shut down by pressing the Off button. This shuts down immediately. </li>\n<li>Before shutting off the red compressor, it is advisable to manually open the drain valves to purge the condensate collectors. This should only take about 5 seconds each (There are 3). Ensure the knobs are fully tightened when done.</li>\n<li>Turn off the Blue Air Dryer, unplug the heater and air dryer (Two plugs behind the Blue Air Dryer), turn off the O2 Analyzer and ensure the banks are closed.</li>\n<li>Shut off the breakers for the Compressors and Fans.</li>\n</ul>\n<p>!!! alert\n     - If the banks are not closed, they will leak through the O2 analyzer overnight and drain down significantly</p>\n<h2>Conclusion</h2>\n<p>Strict adherence to this SOP ensures the safe and efficient operation of our compressors. Your diligence and attention to detail are crucial in maintaining the high standards of Sea Saba’s diving operations.</p>\n",
  "excerpt": "SOP: Compressor Operations\r \r  Purpose\r \r The purpose of this Standard Operating Procedure (SOP) is to ensure the safe, efficient, and consistent...",
  "path": "/Equipment/CompressorOperation",
  "lastModified": "2025-12-04T16:50:37.187Z",
  "category": "Equipment",
  "originalId": "Equipment/CompressorOperation"
}