{
  "id": "RetailOperations/RetailOpenClosing",
  "title": "Store Opening & Closing Instructions",
  "content": "<h1>Retail Shop Opening and Closing Procedures</h1>\n<p>!!! alert\n    <strong>This SOP is currently under revision due to the retail location change. Please confirm procedures with management if anything is unclear.</strong></p>\n<h3>Opening Procedures</h3>\n<h4>1.1 Lights and Air Conditioning</h4>\n<ul>\n<li>Turn on all lights.</li>\n<li>Turn on the air conditioner <strong>(no lower than 76F/24C)</strong>.</li>\n<li>Use the remote to turn on the fan above the register after flipping the light switch.</li>\n</ul>\n<h4>1.2 Computer and Cash Drawer</h4>\n<ul>\n<li>Wake up the tablet and ensure that Shopify is open. Verify that the card reader is powered on. If not, remove it from the holder and press the button on the back.</li>\n<li>Open the cash register to begin the tracking session. Count the float; it should amount to $200. If the float is incorrect, cross-check with the opening amount and report any discrepancies to management promptly.</li>\n</ul>\n<h4>1.3 Doors and Shutters</h4>\n<ul>\n<li>Open all shutters, and unlock front door.</li>\n<li>Leave side door behind register locked.<blockquote>\n<p><strong>Be careful not to get locked out of the store</strong></p>\n</blockquote>\n</li>\n</ul>\n<h3>Retail Closing Procedures</h3>\n<h4>2.1 Restocking</h4>\n<ul>\n<li>Ensure all T-shirts are neatly restocked, maintaining two of each size on display, unless a particular size is sold out.</li>\n<li>Restock any stickers, magnets, water bottles, rum, etc... if sold.</li>\n<li>If we are running low on stock please notify management so that we can order new stock.</li>\n</ul>\n<h4>2.2 Operating Hours</h4>\n<ul>\n<li>Lunch is 30 minutes, please note on the sign when you will return from lunch so customers know when to return.</li>\n<li>Do not close earlier than scheduled without approval.</li>\n</ul>\n<h4>2.3 Doors and Shutters</h4>\n<ul>\n<li>Close all shutters, leave side door open so you can still get in to finish closing</li>\n<li>Lock main door.</li>\n</ul>\n<h4>2.4 Cash Handling</h4>\n<ul>\n<li>Lock doors before counting the cash. Count cash discreetly, away from public view, unless in the presence of authorized individuals.</li>\n<li>Remove bigger bills before smaller ones.</li>\n<li>Paperclip closing receipt to cash deposit, and drop it in safe.</li>\n</ul>\n<h4>2.5 Final Steps</h4>\n<ul>\n<li>Take out the trash if full.</li>\n<li>Turn off air conditioner and lights.</li>\n<li>Lock side door, and close and lock the shutter.</li>\n</ul>\n<blockquote>\n<p><strong>NOTE:</strong> Any deviations from these procedures should be communicated to management immediately. These protocols are designed to ensure operational efficiency, security, and a pleasant shopping experience for our customers. Thank you for your attention to detail and dedication to maintaining our store&#39;s standards.</p>\n</blockquote>\n",
  "excerpt": "Retail Shop Opening and Closing Procedures\r \r !!! alert\r     This SOP is currently under revision due to the retail location change. Please confirm...",
  "path": "/RetailOperations/RetailOpenClosing",
  "lastModified": "2025-12-04T16:50:37.440Z",
  "category": "Retail Operations",
  "originalId": "RetailOperations/RetailOpenClosing"
}